title: Hiding Files with Attrib.exe
id: 4281cb20-2994-4580-aa63-c8b86d019934
status: test
description: Detects usage of attrib.exe to hide files from users.
references:
    - https://unit42.paloaltonetworks.com/unit42-sure-ill-take-new-combojack-malware-alters-clipboards-steal-cryptocurrency/
    - https://www.uptycs.com/blog/lolbins-are-no-laughing-matter
author: Sami Ruohonen
date: 2019/01/16
modified: 2023/03/14
tags:
    - attack.defense-evasion
    - ATTACK.T1564
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Process|endswith: '\attrib.exe'
    selection_cli:
        CommandLine|contains: ' +h '
    filter_main_msiexec:
        CommandLine|contains: '\desktop.ini '
    condition: selection_img and selection_cli and not filter_main_msiexec
falsepositives:
    - Msiexec.exe hiding desktop.ini
level: medium