title: Suspicious PowerShell Command
id: a1b2c3d4-e5f6-1234-9876-abcdef123456
status: experimental
description: Detects suspicious PowerShell command execution containing "Invoke-WebRequest"
author: dhif
date: 2025/09/05
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: 'Invoke-WebRequest'
  condition: selection
level: high
tags:
  - attack.execution
  - attack.t1059
