# source: test4.yml
id: SIGMA-2345-672
name: Suspicious Net Command Execution for Enumeration
description: Detects suspicious use of net.exe for user or group enumeration, potentially
  indicating reconnaissance
tactics:
- discovery
techniques:
- ATTACK.T1087
- ATTACK.T1069
severity: High
query: 'imProcessCreate

  | where ((TargetProcessCommandLine contains "net user" or TargetProcessCommandLine
  contains "net group" or TargetProcessCommandLine contains "net localgroup") and
  TargetProcessName endswith "\\net.exe") and (not((TargetProcessCommandLine contains
  "net user administrator /domain" or TargetProcessCommandLine contains "net group
  \"Domain Admins\" /domain")))'
status: test
version: 1.0
clients:
- '*'
tags: []
author: dhif
last_modified: '2025-09-24T07:37:57'
