# source: test7.yml
id: SIGMA-6789-016
name: Suspicious Registry Modification via Reg Command
description: Detects suspicious use of reg.exe to modify Windows Registry keys, potentially
  indicating persistence or configuration tampering
tactics:
- defense_evasion
- persistence
techniques:
- ATTACK.T1112
severity: High
query: 'DeviceProcessEvents

  | where ((TargetProcessCommandLine contains "reg add" or TargetProcessCommandLine
  contains "reg delete" or TargetProcessCommandLine contains "reg load") and TargetProcessName
  endswith "\\reg.exe") and (not((TargetProcessCommandLine contains "HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run"
  or TargetProcessCommandLine contains "reg add \"HKLM\\Software\\Microsoft\\Updates\"")))'
status: test
version: 1.0
clients:
- '*'
tags: []
author: dhif
last_modified: '2025-09-25T21:37:30'
