# source: test1.yml
id: SIGMA-9535-294
name: Test Rule
description: Test
tactics:
- execution
techniques: []
severity: High
query: 'imProcessCreate

  | where TargetProcessCommandLine contains "test"'
status: test
version: 1.0
clients:
- '*'
tags: []
author: community
last_modified: '2025-09-21T19:08:10'
