# source: test1.yml
id: SIGMA-8695-303
name: Test Rule
description: Test
tactics:
- execution
techniques: []
severity: High
query: 'imProcessCreate

  | where TargetProcessCommandLine contains "test"'
status: test
version: 1.0
clients:
- '*'
tags: []
author: community
last_modified: '2025-09-24T19:37:58'
