# source: test2.yml
id: SIGMA-1234-561
name: Suspicious PowerShell Command
description: Detects suspicious PowerShell command execution containing "Invoke-WebRequest"
tactics:
- execution
techniques:
- ATTACK.T1059
severity: High
query: 'imProcessCreate

  | where TargetProcessCommandLine contains "Invoke-WebRequest"'
status: test
version: 1.0
clients:
- '*'
tags: []
author: dhif
last_modified: '2025-09-24T08:16:08'
