# source: PowerShell Execution.yml
id: SIGMA-6286-154
name: Test Rule - PowerShell Execution
description: Règle de test pour valider le pipeline DaaC
tactics: []
techniques: []
severity: Medium
query: 'imProcessCreate

  | where TargetProcessName endswith "\\powershell.exe"'
status: test
version: 1.0
clients:
- '*'
tags: []
author: SOC Team
last_modified: '2025-09-25T07:33:38'
