id: SOC-2025-001
name: "Suspicious PowerShell EncodedCommand"
description: "Detecte l'utilisation de -EncodedCommand dans PowerShell"
tactics:
  - execution
  - defense-evasion
techniques:
  - ATTACK.T1059.001
severity: High
query: |
  DeviceProcessEvents
  | where Process has "powershell"
  | where ProcessCommandLine has "-EncodedCommand"
status: active
version: 1.0
clients:
  - client_a
  - client_b
tags:
  - powershell
  - obfuscation
author: analyste.jean